Австралия/src/Catalogs/FinancialReportsItems/FinancialReportsItems.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>FinancialReportsItems</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.FinancialReportsTypes</owners>
  <attributes>
    <name>ItemType</name>
    <type>
      <types>EnumRef.FinancialReportItemsTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>DescriptionForPrinting</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ReverseSign</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>AdditionalFilter</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>HasSettings</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AnalyticsValue</name>
    <type>
      <types>ChartOfAccountsRef</types>
    </type>
  </attributes>
  <attributes>
    <name>LinkedItem</name>
    <type>
      <types>CatalogRef.FinancialReportsItems</types>
    </type>
  </attributes>
  <attributes>
    <name>DescriptionForPrintingLanguage1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DescriptionForPrintingLanguage2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DescriptionForPrintingLanguage3</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DescriptionForPrintingLanguage4</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ItemTypeAttributes</name>
    <attributes>
      <name>Attribute</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.FinancialReportsItemsAttributes</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.FinancialReportsItemsAttributes</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>FormulaOperands</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Operand</name>
      <type>
        <types>CatalogRef.FinancialReportsItems</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>TableItems</name>
    <attributes>
      <name>Row</name>
      <type>
        <types>CatalogRef.FinancialReportsItems</types>
      </type>
    </attributes>
    <attributes>
      <name>Column</name>
      <type>
        <types>CatalogRef.FinancialReportsItems</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.FinancialReportsItems</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AdditionalFields</name>
    <attributes>
      <name>Attribute</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Description</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>OutputTitle</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>InSeparateColumn</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AppearanceItems</name>
    <attributes>
      <name>Appearance</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>Condition</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>AppearanceAppliedAreaType</name>
      <type>
        <types>EnumRef.AppearanceAppliedAreasTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>AppearanceItemKey</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AppearanceAppliedRows</name>
    <attributes>
      <name>ReportItem</name>
      <type>
        <types>CatalogRef.FinancialReportsItems</types>
      </type>
    </attributes>
    <attributes>
      <name>AppearanceItemKey</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AppearanceAppliedColumns</name>
    <attributes>
      <name>ReportItem</name>
      <type>
        <types>CatalogRef.FinancialReportsItems</types>
      </type>
    </attributes>
    <attributes>
      <name>AppearanceItemKey</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AppearanceItemsFilterFieldsDetails</name>
    <attributes>
      <name>ReportItem</name>
      <type>
        <types>CatalogRef.FinancialReportsItems</types>
      </type>
    </attributes>
    <attributes>
      <name>AppearanceItemKey</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>FilterFieldName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ResourceName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ValuesSources</name>
    <attributes>
      <name>Source</name>
      <type>
        <types>CatalogRef.FinancialReportsItems</types>
      </type>
    </attributes>
    <attributes>
      <name>AddedDocumentValues</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Австралия/src/Enums/NewItemsTreeDisplayModes/NewItemsTreeDisplayModes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>NewItemsTreeDisplayModes</name>
  <enumValues>
    <name>BudgetTypeSetting</name>
  </enumValues>
  <enumValues>
    <name>BudgetTypeUserDefinedCalculatedIndicator</name>
  </enumValues>
  <enumValues>
    <name>ComplexTableUserDefinedCalculatedIndicator</name>
  </enumValues>
  <enumValues>
    <name>ComplexTableCellTypeSelection</name>
  </enumValues>
  <enumValues>
    <name>ComplexTableAutoCalculationSetting</name>
  </enumValues>
  <enumValues>
    <name>ReportTypeSetting</name>
  </enumValues>
  <enumValues>
    <name>ReportTypeSettingIndicatorsOnly</name>
  </enumValues>
  <enumValues>
    <name>BudgetItemFilling</name>
  </enumValues>
</mdclass:Enum>

Австралия/src/Catalogs/FinancialReportsItems/Forms/ReportIndicatorTypeSelection/Module.bsl
#Region FormEventHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	RefreshNewItemsTree();
	
EndProcedure

#EndRegion

#Region FormHeaderItemsEventHandlers

&AtClient
Procedure NewItemsQuickSearchOnChange(Item)
	
	RefreshNewItemsTree();
	For Each Row In NewItemsTree.GetItems() Do
		Items.NewItemsTree.Collapse(Row.GetID());
		Items.NewItemsTree.Expand(Row.GetID(), False);
	EndDo;
	
EndProcedure

&AtClient
Procedure ExistingItemsQuickSearchOnChange(Item)
	
	RefreshExistingItemsTree();
	
EndProcedure

#EndRegion

#Region FormTableItemsEventHandlersNewItemsTree

&AtClient
Procedure NewItemsTreeSelection(Item, RowSelected, Field, StandardProcessing)
	
	StandardProcessing = False;
	ReportItemSelectionProcessing();
	
EndProcedure

#EndRegion

#Region FormTableItemsEventHandlersExistingItemsTree

&AtClient
Procedure ExistingItemsTreeSelection(Item, RowSelected, Field, StandardProcessing)
	
	StandardProcessing = False;
	ReportItemSelectionProcessing();
	
EndProcedure

&AtClient
Procedure ReportTypeFilterOnChange(Item)
	
	RefreshExistingItemsTree();
	
EndProcedure

#EndRegion

#Region FormCommandsEventHandlers

&AtClient
Procedure FindNewItem(Command)
	
	RefreshNewItemsTree();
	For Each Row In NewItemsTree.GetItems() Do
		Items.NewItemsTree.Collapse(Row.GetID());
		Items.NewItemsTree.Expand(Row.GetID(), False);
	EndDo;
	
EndProcedure

&AtClient
Procedure FindExistingItem(Command)
	
	RefreshExistingItemsTree();
	
EndProcedure

&AtClient
Procedure Select(Command)
	
	ReportItemSelectionProcessing();
	
EndProcedure

#EndRegion

#Region Private

&AtClient
Procedure ReportItemSelectionProcessing()
	
	CurrentData = CurrentItem.CurrentData;
	If Not ValueIsFilled(CurrentData.ItemType)
		Or CurrentData.IsFolder Then
		ShowMessageBox(Undefined, NStr("en = 'Item cannot be selected'; ru = 'Невозможно выбрать элемент';pl = 'Nie można wybrać elementu';es_ES = 'No se puede seleccionar el elemento';es_CO = 'No se puede seleccionar el elemento';tr = 'Öğe seçilemiyor';it = 'L''elemento non può essere selezionato';de = 'Element kann nicht ausgewählt werden'"));
		Return;
	EndIf;
	
	Result = New Structure("ReportItem, ItemType, DescriptionForPrinting");
	Result.ItemType = CurrentData.ItemType;
	Result.DescriptionForPrinting = CurrentData.DescriptionForPrinting;
	If CurrentData.Property("IsLinked") Then
		Result.Insert("LinkedItem", CurrentData.LinkedItem);
		Result.Insert("IsLinked", True);
	Else
		Result.Insert("ReportItem", CurrentData.ReportItem);
		Result.Insert("IsLinked", False);
	EndIf;
	Close(Result);
	
EndProcedure

&AtServer 
Procedure RefreshNewItemsTree()
	
	TreeParameters = FinancialReportingClientServer.ItemsTreeNewParameters();
	TreeParameters.WorkMode = Enums.NewItemsTreeDisplayModes.ReportTypeSettingIndicatorsOnly;
	TreeParameters.QuickSearch = NewItemsQuickSearch;
	
	FinancialReportingServer.RefreshNewItemsTree(ThisObject, TreeParameters);
	Return;
	
EndProcedure

&AtClient
Procedure RefreshExistingItemsTree()
	
	RefreshExistingItemsTreeAtServer();
	If ValueIsFilled(ReportTypeFilter) Then
		FinancialReportingClient.ExpandExistingItemsTree(ThisObject, ExistingItemsTree);
	EndIf;
	
EndProcedure

&AtServer 
Procedure RefreshExistingItemsTreeAtServer()
	
	If Not ValueIsFilled(ExistingItemsQuickSearch)
		And Not ValueIsFilled(ReportTypeFilter) Then
		ExistingItems = ExistingItemsTree.GetItems();
		ExistingItems.Clear();
		Return;
	EndIf;

	TreeParameters = FinancialReportingClientServer.ItemsTreeNewParameters();
	TreeParameters.ItemsTreeName = "ExistingItemsTree";
	TreeParameters.WorkMode = Enums.NewItemsTreeDisplayModes.ReportTypeSettingIndicatorsOnly;
	TreeParameters.ReportTypeFilter = ReportTypeFilter;
	TreeParameters.QuickSearch = ExistingItemsQuickSearch;
	
	FinancialReportingServer.RefreshExistingItemsTree(ThisObject, TreeParameters);
	
EndProcedure

#EndRegion
